Autodesk.Revit.DB.Definitions.Create(Autodesk.Revit.DB.ExternalDefinitonCreationOptions)
Creates a new parameter definition using specified options.
option: The options used to create the new parameter definition.
Returns: If successful a reference to the new parameter definition is returned, otherwise null.
Remarks: This method only supports creation of new external definitions (shared parameters).
options.Name cannot include non-printable characters.
options.Name is already present in the associated shared parameter definitions.
options.GUID is already present in the associated shared parameter definitions.
Since:
2015

Autodesk.Revit.DB.Definitions.Create(System.String,Autodesk.Revit.DB.ParameterType,System.Boolean,System.Guid@)
Creates a new parameter definition using name, type, visibility and a specified Guid.
name: The name of the parameter definition to be created.
type: The name of the parameter type for the new definition.
visible: True if the parameter is visible to the user, false if it is hidden and accessible only via the API.
guid: The GUID to use for this parameter definition.
Returns: If successful a reference to the new parameter definition is returned, otherwise null.
Remarks: This method only supports creation of new external defintions (shared parameters).
Name cannot include non-printable characters.
Name is already present in the associated shared parameter definitions.
GUID is already present in the associated shared parameter definitions.

Autodesk.Revit.DB.Definitions.Create(System.String,Autodesk.Revit.DB.ParameterType,System.Boolean)
Creates a new parameter definition using name, type and visibility.
name: The name of the parameter definition to be created.
type: The name of the parameter type for the new definition.
visible: True if the parameter is visible to the user, false if it is hidden and accessible only via the API.
Returns: If successful a reference to the new parameter definition is returned, otherwise null.
Remarks: This method only supports creation of new external defintions (shared parameters).
Name cannot include non-printable characters.
Name is already present in the associated shared parameter definitions.

Autodesk.Revit.DB.Definitions.Create(System.String,Autodesk.Revit.DB.ParameterType)
Creates a new parameter definition.
Creates a new parameter definition using name and type.
name: The name of the parameter definition to be created.
type: The name of the parameter type for the new definition.
Returns: If successful a reference to the new parameter definition is returned, otherwise null.
Remarks: This method only supports creation of new external defintions (shared parameters).
Name cannot include non-printable characters.
Name is already present in the associated shared parameter definitions.